IEEE1888_PostFormat.TXT

POST /axis2/services/FIAPStorage HTTP/1.1
Content-Type: text/xml charset=UTF-8
User-Agent: FIAPUploadAgent (STM32F4 MCU)
Host: 10.217.0.3
SOAPAction: "http://soap.fiap.org/data"
Content-Length: 3780

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<ns2:dataRQ xmlns:ns2="http://soap.fiap.org/">
<transport xmlns="http://gutp.jp/fiap/2009/11/">
<body>
<pointSet id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/">
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/c00/status">
<value time="2018-09-10T07:15:00+07:00">7000</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch01">
<value time="2018-09-10T07:15:00+07:00">0.02</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch02">
<value time="2018-09-10T07:15:00+07:00">-0.01</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch03">
<value time="2018-09-10T07:15:00+07:00">-0.01</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch04">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch05">
<value time="2018-09-10T07:15:00+07:00">0.01</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch06">
<value time="2018-09-10T07:15:00+07:00">0.01</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch07">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch08">
<value time="2018-09-10T07:15:00+07:00">0.06</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch09">
<value time="2018-09-10T07:15:00+07:00">-0.01</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch10">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch11">
<value time="2018-09-10T07:15:00+07:00">9.80</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch12">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch13">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch14">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch15">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch16">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch17">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
<point id="http://chamchuri5.chula.ac.th/chamchuri5/fl1/elevator_hall/shaft_room/meter/2/monitor/energy_ch18">
<value time="2018-09-10T07:15:00+07:00">0.00</value>
</point>
</pointSet>
</body>
</transport>
</ns2:dataRQ>
</soapenv:Body>
</soapenv:Envelope>
